* Description
Given a non-negative integer c, your task is to decide whether there're two integers a and b such that a2 + b2 = c.

Example 1:

Input: 5
Output: True
Explanation: 1 * 1 + 2 * 2 = 5

Example 2:

Input: 3
Output: False

* Solution
#+BEGIN_SRC cpp
  #include <iostream>
  #include <math.h>

  using namespace std;
  class Solution {
  public:
    bool judgeSquareSum(int c) {
      for (int i = 0; i < sqrt(c) + 1; i++) {
        int remain = sqrt(c - i * i);
        if (remain * remain + i * i == c) {
          return true;
        }
      }
      return false;
    }
  };

  int main(int argc, char *argv[]) {
    Solution solution = Solution();
    cout << solution.judgeSquareSum(999999999);
    return 0;
  }
#+END_SRC

#+RESULTS:
: 0
